---
kind: property
id: P:Autodesk.Revit.DB.InsulationLiningBase.HostElementId
source: html/3bd52d75-7aea-1d0f-0ff6-0eae6b9a4928.htm
---
# Autodesk.Revit.DB.InsulationLiningBase.HostElementId Property

The id of the host element for the insulation or lining element.

## Syntax (C#)
```csharp
public ElementId HostElementId { get; }
```